{"keras_version": "2.1.2", "class_name": "Sequential", "backend": "theano", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "kernel_size": [3, 3], "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "batch_input_shape": [null, 64, 64, 3], "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "padding": "valid", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "activation": "relu", "units": 128, "use_bias": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "activation": "sigmoid", "units": 1, "use_bias": true, "name": "dense_2"}}]}